import random
flag = True
answers = ['Бесспорно',	'Мне кажется - да',	'Пока неясно, попробуй снова', 'Даже не думай', 'Предрешено',
           'Вероятнее всего', 'Спроси позже', 'Мой ответ - нет', 'Никаких сомнений', 'Хорошие перспективы',
           'Лучше не рассказывать',	'По моим данным - нет', 'Определённо да', 'Знаки говорят - да','Сейчас нельзя предсказать',
           'Перспективы не очень хорошие', 'Можешь быть уверен в этом', 'Да','Сконцентрируйся и спроси опять', 'Весьма сомнительно']
print('Привет Мир, я магический шар, и я знаю ответ на любой твой вопрос.')
print('Как вас зовут?')
name = input()
print('Здравствуй,', name)

while flag == True:
    print('Задай любой вопрос, я постараюсь на него ответить')
    question = input()
    print(random.choice(answers))
    print('Есть ли у тебя еще вопросы?')
    prodo = input()
    if prodo.lower() == 'да':
        flag = True
    else:
        flag = False
        print('Возвращайся если возникнут вопросы!')

